app/Http/Livewire/TvShows/Home.php

select * from `slugs` where `key` = 'tv-shows' limit 1
select * from `pages` where `pages`.`id` = 10 limit 1
---
    public function mount(){
        $slug = Slug::where('key', "tv-shows")->firstorFail();

        $this->tvShow = Page::findOrFail($slug->reference_id);

select * from `tv_shows` where year(`created_at`) = 2023 and month(`created_at`) = '09' order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `tv_shows` where year(`created_at`) = 2023 and month(`created_at`) = '09'
---
    public function render()
    {
        return view('livewire.tv-shows.home', ['tvShows' => TvShowRepository::all([
            'sortByTitle' => $this->sortByTitle,
            'sortByTime' => $this->sortByTime,
            'sortByDate' => $this->sortByDate
        ])->paginate(12)])->layout('layouts.app', [
            'seo_title' => $this->tvShow->meta->meta_value[0]['seo_title'] ?? $this->tvShow->name,
            'seo_description' => $this->tvShow->meta->meta_value[0]['seo_description'] ?? ''
        ]);