app/Http/Livewire/TvShows/Show.php

select * from `tv_show_views` where (`user_id` is null and `tv_show_id` = 1 and `episode_id` is null and `ip_address` = '127.0.0.1') limit 1
---
    public function mount($slug){

        $this->fill([
            'tvShow' => TvShowRepository::getTvShowBySlug($slug)
        ]);

        if(request()->has(['season', 'episode'])){
            $this->fill([
                'selectedEpisode' => EpisodeRepository::getEpisodeBySlug(request('episode'), $this->tvShow->id),
                'season_number' => request('season')
            ]);
        }

        $this->fill([
            'seasons' => TvShowRepository::getTvShowSeasons($this->tvShow->id),

            'casts' => CastRepository::getCastsByShow($this->tvShow->id)
        ]);

        $this->episodes = EpisodeRepository::getEpisodesBySeason($this->tvShow->id, $this->seasons[0]->id);


//        $data = [
//            'user_id' => auth()->id(),
//            'tv_show_id' => $this->tvShow->id,
//            'episode_id' => $this->selectedEpisode->id ?? NULL,
//            'ip_address' => request()->ip()
//        ];


        $tvShowViews = TvShowView::where('user_id',  auth()->id())
            ->where('ip_address',  request()->ip())
            ->where('tv_show_id', $this->tvShow->id)
            ->first();