app/Http/Livewire/Admin/Shows/Edit.php

select `show_categories`.*, `show_category_tv_show`.`tv_show_id` as `pivot_tv_show_id`, `show_category_tv_show`.`show_category_id` as `pivot_show_category_id` from `show_categories` inner join `show_category_tv_show` on `show_categories`.`id` = `show_category_tv_show`.`show_category_id` where `show_category_tv_show`.`tv_show_id` = 1
select `casts`.*, `cast_tv_show`.`tv_show_id` as `pivot_tv_show_id`, `cast_tv_show`.`cast_id` as `pivot_cast_id` from `casts` inner join `cast_tv_show` on `casts`.`id` = `cast_tv_show`.`cast_id` where `cast_tv_show`.`tv_show_id` = 1
---
    public function mount($id){
        $this->tvShow = TvShowRepository::getTvShowById($id);

        $this->fill([
            'categories' => ShowCategoryRepository::all(),
            'casts' => CastRepository::all(),
            'title' => $this->tvShow->title,
            'description' => $this->tvShow->description,
            'slug' => $this->tvShow->slug,
            'tags' => $this->tvShow->tags,
            'thumbnail' => $this->tvShow->thumbnail,
            'release_date' => $this->tvShow->release_date,
            'trailer' => $this->tvShow->trailer,
            'meta_title' => $this->tvShow->meta_title,
            'meta_description' => $this->tvShow->meta_description,
            'categories_id' => $this->tvShow->categories()->get()->pluck('id'),
            'casts_id' =>  $this->tvShow->casts()->get()->pluck('id'),