app/Http/Livewire/User/Wishlist/Home.php

    public function render()
    {
        $wishlists = Wishlist::where('customer_id', auth()->id())->paginate(12);
---
select * from `ec_wish_lists` where `customer_id` = 1 limit 12 offset 0
select count(*) as aggregate from `ec_wish_lists` where `customer_id` = 1