app/Http/Livewire/Home/Home.php

select * from `slugs` where `key` = 'homepage' limit 1
select * from `pages` where `pages`.`id` = 1 limit 1
---
    public function mount(){
        $slug = Slug::where('key', "homepage")->firstorFail();

        $this->page = Page::findOrFail($slug->reference_id);