app/Http/Livewire/Faqs.php

select * from `faqs` where `status` = 'published'
select * from `slugs` where `key` = 'frequently-asked-questions' limit 1
select * from `pages` where `pages`.`id` = 9 limit 1
---
    public function mount(){
        $this->faqs = Faq::where('status', 'published')->get();

        $slug = Slug::where('key', "frequently-asked-questions")->firstorFail();

        $this->faq = Page::findOrFail($slug->reference_id);