app/Helpers/Common.php

function gs(){
    return (object) \DB::table('settings')->pluck("value","key")->toArray();
---
select `value`, `key` from `settings`