app/Http/Livewire/LiveChannel/Show.php

select * from `streams` where date(`schedule_date`) = '2023-10-06'
---
    public function mount(){
        $records = Stream::whereDate('schedule_date', now())->get();