app/Http/Livewire/User/Watchlist/Home.php

    public function render()
    {
        $watchlists = Watchlist::where('user_id', auth()->id())->paginate(12);
---
select * from `watchlists` where `user_id` = 8 limit 12 offset 0
select count(*) as aggregate from `watchlists` where `user_id` = 8