platform/plugins/ecommerce/src/Http/Controllers/ProductController.php

    public function edit(int|string $id, Request $request, FormBuilder $formBuilder)
    {
        $product = Product::query()->findOrFail($id);
---
select * from `ec_products` where `ec_products`.`id` = '8' limit 1

    public function update(
        int|string $id,
        ProductRequest $request,
        StoreProductService $service,
        BaseHttpResponse $response,
        StoreProductTagService $storeProductTagService
    ) {
        $product = Product::query()->findOrFail($id);

        $product->status = $request->input('status');

        $product = $service->execute($request, $product);
        $storeProductTagService->execute($request, $product);

        if ($request->has('variation_default_id')) {
            ProductVariation::query()
                ->where('configurable_product_id', $product->getKey())
                ->update(['is_default' => 0]);

            $defaultVariation = ProductVariation::query()->find($request->input('variation_default_id'));
            if ($defaultVariation) {
                $defaultVariation->is_default = true;
                $defaultVariation->save();
---
select * from `ec_products` where `ec_products`.`id` = '28' limit 1
select * from `ec_product_variations` where `ec_product_variations`.`id` = '66' limit 1
update `ec_product_variations` set `is_default` = 1 where `id` = 66


        $relatedProductIds = $product->variations()->pluck('product_id')->all();

        Product::query()->whereIn('id', $relatedProductIds)->update(['status' => $product->status]);
---
update `ec_products` set `status` = '{\"value\":\"published\",\"label\":\"Published\"}', `ec_products`.`updated_at` = '2023-09-22 11:23:08' where `id` in (131, 132)

    public function getProductVariations(int|string $id, ProductVariationTable $dataTable)
    {
        $product = Product::query()
            ->where('is_variation', 0)
            ->findOrFail($id);
---
select * from `ec_products` where `is_variation` = 0 and `ec_products`.`id` = '54' limit 1