app/Http/Livewire/Product/Home.php

    public function render()
    {
        return view('livewire.product.home', ['products' => Product::published()->paginate(12)]);
---
select * from `ec_products` limit 12 offset 24
select count(*) as aggregate from `ec_products`