app/Http/Livewire/Product/Show.php

select * from `slugs` where `key` = 'dual-camera-20mp-digital' limit 1
select * from `ec_products` where `ec_products`.`id` = 1 limit 1
---
    public function mount($slug){
         $slug = Slug::where('key', $slug)->firstorFail();

         $this->product = Product::findOrFail($slug->reference_id);