platform/plugins/plan/src/Http/Controllers/PlanController.php

select * from `plans` where `plans`.`id` = '4' limit 1
---
    public function edit(FormBuilder $formBuilder, $id)
    {

        $plan = Plan::find($id);