app/Repositories/AuthRepository.php

select count(*) as aggregate from `activations` where `activations`.`user_id` = 1 and `activations`.`user_id` is not null
---
    public static function login($data)  {
            auth()->attempt($data, true);

            $user = auth()->user();

            if($user){
                if($user->activations()->count() === 0){