app/Repositories/CastRepository.php

select * from `casts`
---
    public static function all()
    {
        return Cast::all();

select * from `casts` where exists (select * from `tv_shows` inner join `cast_tv_show` on `tv_shows`.`id` = `cast_tv_show`.`tv_show_id` where `casts`.`id` = `cast_tv_show`.`cast_id` and `tv_shows`.`id` = 1)
---
    public static function getCastsByShow($tvShowId) : Collection
    {
        return Cast::whereHas('tvshows', function($q) use($tvShowId) {
            $q->where('tv_shows.id', $tvShowId);
        })->get();