app/Repositories/EpisodeRepository.php

select * from `episodes` where `episodes`.`id` = 1 limit 1
---
    public static function getEpisodeById(int $id) : Episode
    {
            return Episode::findOrFail($id);

select * from `episodes` where `slug` = 'selfies' and `tv_show_id` = 1 limit 1
---
    public static function getEpisodeBySlug($slug, $tvShowId) : Episode
    {
        return Episode::where('slug', $slug)->where('tv_show_id', $tvShowId)->first();

select * from `episodes` where `season_number` = '1' and `tv_show_id` = 1
---
    public static function getEpisodesBySeason($tvshowId, $seasonNumber){
        return Episode::where('season_number', $seasonNumber)->where('tv_show_id', $tvshowId)->get();