app/Repositories/MemberRepository.php

select * from `users` where `users`.`id` = 21 and `users`.`deleted_at` is null limit 1
update `users` set `password` = '$2y$10$Ny3OijzLrqz66fPTqlINcutYlNzLSm0xqA22F8o2jTccMT5oaRRwi', `users`.`updated_at` = '2023-10-02 09:09:54' where `id` = 21
---
    public static function updateMember(array $data, int $id) : User
    {
         $member = User::find($id);

         $member->update(array_merge($data, ['password' => $data['password'] ? bcrypt($data['password']) : $member->password]));