app/Repositories/PodcastRepository.php

    public static function getPodcastBySlug($slug) : Podcast
    {
        return Podcast::where('slug', $slug)->firstOrFail();
---
select * from `podcasts` where `slug` = 'title' limit 1