app/Repositories/ShowCategoryRepository.php

    public static function all()
    {
        return ShowCategory::all();
---
select * from `show_categories`