app/Repositories/StreamRepository.php

select * from `streams` where `streams`.`id` = 6 limit 1
---
    public static function getStreamById(int $id){
        return Stream::findOrFail($id);

select * from `streams` where `slug` = 'play-this-2' limit 1
---
    public static function getTvChannelBySlug($slug) : Stream {
        return Stream::where('slug',$slug)->firstOrFail();