app/Repositories/TvShowRepository.php

    public static function getTvShowById(int $id) : TvShow
    {
            return TvShow::findOrFail($id);
---
select * from `tv_shows` where `tv_shows`.`id` = 1 limit 1

    public static function getTvShowBySlug($slug) : TvShow
    {
        return TvShow::where('slug', $slug)->firstOrFail();
---
select * from `tv_shows` where `slug` = 'merlin' limit 1

    public static function getTvShowSeasons($tvshowId) : array{
        return Episode::groupBy('tv_show_id', 'season_number')->distinct()->where('tv_show_id',
        $tvshowId)->select("episodes.season_number")->pluck('season_number')->toArray();
---
select distinct `episodes`.`season_number` from `episodes` where `tv_show_id` = 1 group by `tv_show_id`, `season_number`

    public static function recentlyWatched($user = null) : Collection {
         return Episode::whereHas('views', function($q) use($user) {
            $q->when($user, function($q) use($user) {
                $q->latest()->where('user_id', $user->id);
            });
         })->get();
---
select * from `episodes` where exists (select * from `tv_show_views` where `episodes`.`id` = `tv_show_views`.`episode_id` and `user_id` = 1 order by `created_at` desc)

    public static function getRecommendedTvShows($limit = 20) : Collection {
        return TvShow::where("is_recommended", 1)->get()->take($limit);
---
select * from `tv_shows` where `is_recommended` = 1